import { Element } from "react-scroll";
import Image from "next/image";
import hero from '../../public/images/hero/hero.webp';

export default function Hero() {
    return (
        <section>
        <Element name="hero">
            <h1 className="text-4xl mb-1 text-center">Знайди свій стиль!</h1>
            </Element>
            <div className="relative w-full h-80">
                <Image fill style={{ objectFit: "cover", zIndex: -2}} priority src={hero} alt="Girl is jumping" />
        </div>
            <p className="pl-1 indent-2.5">Ласкаво просимо в дисконт магазин «СпортТовари».
                На сайті ви можете придбати одяг для занять спортом, активного відпочинку і повсякденного життя
                від популярних світових брендів Puma, Reebok. Ми спеціалізований інтернет-магазином одягу Adidas, взуття New Balance, аксесуарів та інших товарів для спорту.
                В каталозі представлено понад 5 000 товарів для спорту і щодня поповнюється новими колекціями adidas.
                Це дозволяє запропонувати широкий вибір спортивних товарів, навіть для най вимогливiшого покупця.</p>
            <p className="pl-1 indent-2.5">Сьогодні одяг для спорту високої якості купити не так просто.
                Якщо ви не хочете стати жертвою шахрайства, вам сюди. Ми реалізуємо тільки
                оригінальні колекції - Adidas, Reebok. Висока якість товару, за рахунок постійного вдосконалення технологій
                виробництва дають Вам можливість максимально насолоджуватися зручністю, навіть дуже тривалій шкарпетці.</p>
            <p className="pl-1 indent-2.5">Доставка по всій території України. Не важливо в якому населеному пункті Ви живете:
                Сєвєродонецьк, Павлоград, Бровари, Бердянськ, Нікополь, Слов'янськ, Мелітополь, Краматорськ, Біла Церква, Кременчук,
                Кам'янське, Кам'янець-Подільський, Лисичанськ, Олександрія, Костянтинівка, Алчевськ, Конотоп, Умань, Бердичів,
                Бердичів, Шостка, Ізмаїл, - наш інтернет магазин доставить покупку зручним способом: кур'єр, новою поштою, самовивіз.</p>
        </section>)
 };